resources/lab4/channel_optimization/system/controlDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	controlDict;
}
application	simpleFoam;
startFrom	latestTime;
startTime	0;
stopAt	endTime;
endTime	100.0;
deltaT	1.0;
writeControl	timeStep;
writeInterval	10.0;
purgeWrite	2;
timeFormat	general;
timePrecision	6;
writeFormat	ascii;
writePrecision	7;
writeCompression	uncompressed;
runTimeModifiable	true;

functions 
{
	totalPressureCalculator
	{
		type            pressureTools;
		functionObjectLibs ("libutilityFunctionObjects.so");
		rhoInf 1; 
		pRef  0;        
		rhoName "rhoInf";
		enabled         true;
		outputControl outputTime;
		outputInterval 1;
		calcTotal   true;
		calcCoeff   false;
	}


	outletTotalPressure
	{
		operation	areaIntegrate;
		enabled	true;
		source	patch;
		valueOutput	true;
		sourceName	outlet;
		functionObjectLibs	( "libfieldFunctionObjects.so" );
		surfaceFormat	null;
		type	faceSource;
		log	true;
		outputControl	outputTime;
		fields	("total(p)");
	}
}

