resources/lab4/channel_optimization/constant/transportProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	transportProperties;
}
nu	nu [0 2 -1 0 0 0 0] 1.0E-5;
transportModel	Newtonian;
